load-tests/results/day9-20260905-local4/atomic-500-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: C:\Users\hp ryzen\Desktop\Spring Boot\TicketSystem\load-tests\k6\day9-hot-row.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 2m30s max duration (incl. graceful stop):
              * day9_hot_row: 1 iterations for each of 500 VUs (maxDuration: 2m0s, gracefulStop: 30s)


Run            [ 100% ] setup()
day9_hot_row   [   0% ]

running (0m01.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
day9_hot_row   [   0% ] 500 VUs  0m00.1s/2m0s  000/500 iters, 1 per VU

running (0m02.9s), 487/500 VUs, 13 complete and 0 interrupted iterations
day9_hot_row   [   3% ] 500 VUs  0m01.1s/2m0s  013/500 iters, 1 per VU

running (0m03.9s), 443/500 VUs, 57 complete and 0 interrupted iterations
day9_hot_row   [  11% ] 500 VUs  0m02.1s/2m0s  057/500 iters, 1 per VU

running (0m04.9s), 318/500 VUs, 182 complete and 0 interrupted iterations
day9_hot_row   [  36% ] 500 VUs  0m03.1s/2m0s  182/500 iters, 1 per VU


  █ THRESHOLDS 

    reservation_unexpected_responses
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 200     34.640708/s
    checks_succeeded...: 100.00% 200 out of 200
    checks_failed......: 0.00%   0 out of 200

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 384    66.51016/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 16     2.771257/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 100    17.320354/s
    reservations_created...............: 100    17.320354/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=2.07s min=211.39ms med=2.06s p(90)=2.95s p(95)=3.06s p(99)=3.36s max=3.59s

    HTTP
    http_req_duration..................: avg=2.06s min=186.28ms med=2.06s p(90)=2.95s p(95)=3.06s p(99)=3.36s max=3.59s
      { expected_response:true }.......: avg=2.03s min=186.28ms med=2.02s p(90)=2.78s p(95)=3.02s p(99)=3.3s  max=3.58s
    http_req_failed....................: 3.18%  16 out of 503
    http_reqs..........................: 503    87.121381/s

    EXECUTION
    iteration_duration.................: avg=3.07s min=653.12ms med=3.27s p(90)=3.79s p(95)=3.87s p(99)=3.9s  max=3.91s
    iterations.........................: 500    86.601771/s
    vus................................: 318    min=0         max=500
    vus_max............................: 500    min=500       max=500

    NETWORK
    data_received......................: 381 kB 66 kB/s
    data_sent..........................: 293 kB 51 kB/s



running (0m05.8s), 000/500 VUs, 500 complete and 0 interrupted iterations
day9_hot_row ✓ [ 100% ] 500 VUs  0m03.9s/2m0s  500/500 iters, 1 per VU